tap "hashicorp/tap"
tap "homebrew/bundle"
tap "rcmdnk/file"
tap "supabase/tap"
brew "act"
brew "anyenv"
brew "libpng"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arp-scan"
brew "autoconf"
brew "awscli"
brew "gettext"
brew "oniguruma"
brew "bat"
brew "berkeley-db"
brew "bison"
brew "bzip2"
brew "pcre2"
brew "cairo"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "docutils"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libssh"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gcc"
brew "libavif"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "libiconv"
brew "git"
brew "gnu-sed"
brew "pkgconf"
brew "gobject-introspection"
brew "guile"
brew "htop"
brew "icu4c@76"
brew "librsvg"
brew "libzip"
brew "imagemagick"
brew "jpeg"
brew "krb5"
brew "lazygit"
brew "lbzip2"
brew "libedit"
brew "libfido2"
brew "llvm"
brew "lzlib"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "mysql-client"
brew "neovim"
brew "nkf"
brew "nmap"
brew "openssl@1.1"
brew "pdf2svg"
brew "perl"
brew "tidy-html5"
brew "php"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "re2c"
brew "ripgrep"
brew "rust"
brew "serie"
brew "streamlink"
brew "subversion"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireguard-tools"
brew "yazi"
brew "hashicorp/tap/terraform"
brew "rcmdnk/file/brew-file"
brew "supabase/tap/supabase"
cask "alfred"
cask "alt-tab"
cask "android-studio"
cask "arc"
cask "bettertouchtool"
cask "bitwarden"
cask "blackhole-2ch"
cask "chromium"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "ganache"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "hyper"
cask "karabiner-elements"
cask "latexit"
cask "libreoffice"
cask "mactex-no-gui"
cask "multipass"
cask "postman"
cask "prince"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-app"
cask "zoom"
mas "BetterSnapTool", id: 417375580
mas "CrystalFetch", id: 6454431289
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "compulim.indent4to2"
vscode "cschlosser.doxdocgen"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "divlo.vscode-styled-jsx-languageserver"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ijs.emotionsnippets"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jinliming2.vscode-go-template"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinichi-takii.sql-bigquery"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
go "github.com/k1LoW/deck/cmd/deck"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
cargo "dash-mpd-cli"
