tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rcmdnk/file"
brew "anyenv"
brew "libpng"
brew "openssl@1.1"
brew "arp-scan"
brew "autoconf"
brew "bat"
brew "bison"
brew "bzip2"
brew "gettext"
brew "pcre2"
brew "pkg-config"
brew "python@3.9"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gcc"
brew "ghostscript"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "python@3.11"
brew "gobject-introspection"
brew "htop"
brew "jpeg", link: true
brew "krb5"
brew "lbzip2"
brew "libedit"
brew "libiconv"
brew "libpq"
brew "libssh"
brew "libzip"
brew "lzlib"
brew "mas"
brew "neovim"
brew "nmap"
brew "oniguruma"
brew "openssl@3"
brew "perl"
brew "tidy-html5"
brew "php"
brew "python@3.10"
brew "re2c"
brew "ripgrep"
brew "streamlink"
brew "subversion"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireguard-tools"
brew "wireshark"
brew "zlib"
brew "rcmdnk/file/brew-file"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "android-studio"
cask "bettertouchtool"
cask "bitwarden"
cask "discord"
cask "docker"
cask "figma"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "ganache"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "latexit"
cask "mactex-no-gui"
cask "multipass"
cask "notion"
cask "postman"
cask "slack"
cask "tailscale"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "BetterSnapTool", id: 417375580
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "adpyke.vscode-sql-formatter"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "Divlo.vscode-styled-jsx-languageserver"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "franneck94.c-cpp-runner"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "iJS.emotionsnippets"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "JuanBlanco.solidity"
vscode "KevinRose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "Shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "zhuangtongfa.material-theme"
