
# tap repositories and their packages

tap 'homebrew/core'
brew 'anyenv'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'autoconf'
brew 'bash'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'bison'
brew 'brotli'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cjson'
brew 'cmake'
brew 'cmocka'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'dav1d'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnutls'
brew 'gobject-introspection'
brew 'graphite2'
brew 'guile'
brew 'harfbuzz'
brew 'htop'
brew 'icu4c'
brew 'imath'
brew 'isl'
brew 'jbig2dec'
brew 'jpeg'
brew 'jpeg-xl'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libedit'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libmaxminddb'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'libpthread-stubs'
brew 'librist'
brew 'libsamplerate'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'luajit-openresty'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'php'
brew 'pixman'
brew 'pkg-config'
brew 'python@3.10'
brew 'python@3.9'
brew 'rav1e'
brew 're2c'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'sdl2'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'subversion'
brew 'tesseract'
brew 'theora'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vim'
brew 'webp'
brew 'wget'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'wireshark'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-hackgen'
cask 'font-hackgen-nerd'

tap 'homebrew/cask'
cask 'alfred'
cask 'android-studio'
cask 'atom'
cask 'bettertouchtool'
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'ganache'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'hyperswitch'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mactex-no-gui'
cask 'multipass'
cask 'notion'
cask 'postman'
cask 'slack'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'BetterSnapTool (1.9.7)', id: 417375580
mas 'GarageBand (10.4.6)', id: 682658836
mas 'GoodNotes (5.9.14)', id: 1444383602
mas 'iMovie (10.3.3)', id: 408981434
mas 'Keynote (12.0)', id: 409183694
mas 'LINE (7.8.1)', id: 539883307
mas 'Magnet (2.8.0)', id: 441258766
mas 'Numbers (12.0)', id: 409203825
mas 'Pages (12.0)', id: 409201541
mas 'Spark (2.11.20)', id: 1176895641
mas 'WireGuard (1.0.15)', id: 1451685025
mas 'Xcode (13.4)', id: 497799835
