brew "bat"
brew "cmake"
brew "curl"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "htop"
brew "mise"
brew "neovim"
brew "nmap"
brew "ripgrep"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
cask "alt-tab"
cask "azookey"
cask "font-hackgen-nerd"
cask "ghostty"
cask "karabiner-elements"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "thebrowsercompany-dia"
cask "zoom"
go "cmd/go"
go "cmd/gofmt"
